/* 鼠标点击文字特效 */
var a_idx = 0;
var a = new Array("富强", "民主", "文明", "和谐", "自由", "平等", "公正" ,"法治", "爱国", "敬业", "诚信", "友善",
			"老哥稳", "带我飞", "厉害了word哥", "扎心了老铁", "蓝瘦香菇", "还有这种操作?", "就是有这种操作",
			"皮皮虾我们走", "笑到猪叫", "石乐志", "不存在的", "黑车!", "我要下车!", "他还只是个孩子", "请不要放过他",
			"惊不惊喜?", "意不意外?", "我有一个大胆的想法", "你的良心不会痛吗", "你心里就没点b数吗", "没有,我很膨胀",
			"秀", "天秀", "陈独秀", "蒂花之秀", "造化钟神秀", "我去买几个橘子", "你就站在此地", "不要走动",
			"我可能读了假书", "贫穷限制了我的想象力", "打call", "当然是选择原谅她啊", "你有freestyle吗",
			"北大还行撒贝宁", "不知妻美刘强东", "悔创阿里杰克马", "一无所有王健林", "普通家庭马化腾",
			"别点了", "求求你别点了", "你还点", "你再点!", "有本事继续点!", "你厉害", "我投翔",
			"w(·Д·)w", "(#`O′)", "（/TДT)/", "┭┮﹏┭┮", "_(:3」∠)_");
jQuery(document).ready(function($) {
    $("body").click(function(e) {
        var $i = $("<span/>").text(a[a_idx]);
        a_idx = (a_idx + 1) % a.length;
        var x = e.pageX,
        y = e.pageY;
        $i.css({
            "z-index": 9999,
            "top": y - 20,
            "left": x + 1,
            "position": "absolute",
            "font-weight": "bold",
            "color": randomColor()
        });
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
        1500,
        function() {
            $i.remove();
        });
    });
});

/* 返回随机颜色 */
function randomColor() {
	return "rgb("+~~(255*Math.random())+","+~~(255*Math.random())+","+~~(255*Math.random())+")";
}

/* 返回welcome */
Function.prototype.getMultiLine = function () {
    var lines = new String(this);
    lines = lines.substring(lines.indexOf("/*") + 3, lines.lastIndexOf("*/"));
    return lines;
}
var string = function () {
    /*
   
          _____                    _____                    _____            _____                   _______                   _____                    _____          
         /\    \                  /\    \                  /\    \          /\    \                 /::\    \                 /\    \                  /\    \         
        /::\____\                /::\    \                /::\____\        /::\    \               /::::\    \               /::\____\                /::\    \        
       /:::/    /               /::::\    \              /:::/    /       /::::\    \             /::::::\    \             /::::|   |               /::::\    \       
      /:::/   _/___            /::::::\    \            /:::/    /       /::::::\    \           /::::::::\    \           /:::::|   |              /::::::\    \      
     /:::/   /\    \          /:::/\:::\    \          /:::/    /       /:::/\:::\    \         /:::/~~\:::\    \         /::::::|   |             /:::/\:::\    \     
    /:::/   /::\____\        /:::/__\:::\    \        /:::/    /       /:::/  \:::\    \       /:::/    \:::\    \       /:::/|::|   |            /:::/__\:::\    \    
   /:::/   /:::/    /       /::::\   \:::\    \      /:::/    /       /:::/    \:::\    \     /:::/    / \:::\    \     /:::/ |::|   |           /::::\   \:::\    \   
  /:::/   /:::/   _/___    /::::::\   \:::\    \    /:::/    /       /:::/    / \:::\    \   /:::/____/   \:::\____\   /:::/  |::|___|______    /::::::\   \:::\    \  
 /:::/___/:::/   /\    \  /:::/\:::\   \:::\    \  /:::/    /       /:::/    /   \:::\    \ |:::|    |     |:::|    | /:::/   |::::::::\    \  /:::/\:::\   \:::\    \ 
|:::|   /:::/   /::\____\/:::/__\:::\   \:::\____\/:::/____/       /:::/____/     \:::\____\|:::|____|     |:::|    |/:::/    |:::::::::\____\/:::/__\:::\   \:::\____\
|:::|__/:::/   /:::/    /\:::\   \:::\   \::/    /\:::\    \       \:::\    \      \::/    / \:::\    \   /:::/    / \::/    / ~~~~~/:::/    /\:::\   \:::\   \::/    /
 \:::\/:::/   /:::/    /  \:::\   \:::\   \/____/  \:::\    \       \:::\    \      \/____/   \:::\    \ /:::/    /   \/____/      /:::/    /  \:::\   \:::\   \/____/ 
  \::::::/   /:::/    /    \:::\   \:::\    \       \:::\    \       \:::\    \                \:::\    /:::/    /                /:::/    /    \:::\   \:::\    \     
   \::::/___/:::/    /      \:::\   \:::\____\       \:::\    \       \:::\    \                \:::\__/:::/    /                /:::/    /      \:::\   \:::\____\    
    \:::\__/:::/    /        \:::\   \::/    /        \:::\    \       \:::\    \                \::::::::/    /                /:::/    /        \:::\   \::/    /    
     \::::::::/    /          \:::\   \/____/          \:::\    \       \:::\    \                \::::::/    /                /:::/    /          \:::\   \/____/     
      \::::::/    /            \:::\    \               \:::\    \       \:::\    \                \::::/    /                /:::/    /            \:::\    \         
       \::::/    /              \:::\____\               \:::\____\       \:::\____\                \::/____/                /:::/    /              \:::\____\        
        \::/____/                \::/    /                \::/    /        \::/    /                 ~~                      \::/    /                \::/    /        
         ~~                       \/____/                  \/____/          \/____/                                           \/____/                  \/____/         
                                                                                                                                                                       
               
    */
            }

/* 控制台输出 */
if(window.console) {
	var cons = console; 
	if(cons) { 
		cons.group("O(∩_∩)O哈喽！");
		cons.info("这位看代码的童鞋，欢迎欢迎！"); 
        cons.info("如果有发现什么bug，还请帮忙提醒，或者到我的GitHub项目里提交issue哦~ %c(https://github.com/Luke19950111/Luke19950111.github.io)","color:#a517ef;font-weight:bold;");
        cons.log(
            '%c微信：kuai01110',
            'color: #ffffff; background: #222222; font-size: 14px; padding: 5px 10px; border-radius:5px;'
        )
        cons.log(
            '%cqq：937613925',
            'color: #ffffff; background: #222222; font-size: 14px; padding: 5px 10px; border-radius:5px;'
        )
        cons.info(string.getMultiLine())
        // cons.info("此处参考了这位大佬：https://github.com/lewky/lewky.github.io/blob/dev/themes/next/source/js/src/custom.js")
		cons.log("%cluke's Blog", "background-image:-webkit-gradient( linear, left top, right top, color-stop(0, #f22), color-stop(0.15, #f2f), color-stop(0.3, #22f), color-stop(0.45, #2ff), color-stop(0.6, #2f2),color-stop(0.75, #2f2), color-stop(0.9, #ff2), color-stop(1, #f22) );color:transparent;-webkit-background-clip: text;font-size:5em;");
		cons.groupEnd();
	} 
}